{
    "paragraphs": [
        {
            "subheading": "What is a variable in Java?",
            "content": "A variable is a container which stores data specified by a program.\n\nThe data type must be specified in Java as it is a strongly typed language (variables must be specified with a data type) unlike JavaScript which is a loosley typed language.",
            "images": [],
            "textQuiz": [],
            "trueFalseQuiz": [],
            "multipleChoiceQuiz": []
        },
        {
            "subheading": "Local variables",
            "content": "A variable which is declared inside of a method. This variable can only be used within the method.",
            "images": [
                {
                    "url": "/Constants & Variables/CODE(Local Variable).png",
                    "caption": "'A local variable declared as an integer.'"
                }
            ],
            "textQuiz": [],
            "trueFalseQuiz": [],
            "multipleChoiceQuiz": []
        },
        {
            "subheading": "Static variables",
            "content": "A variable which is declared inside of a class but outside of a method. It can be accessed by any class by calling the class name in which it is declared followed by the variable name.\n\nMost static variables are declared public so that they can be accessed by any class but they can also be declared private. Static variables are usually used to declare constants (covered on this page), but can also be used as variables.",
            "images": [
                {
                    "url": "/Constants & Variables/CODE(Static Variable).png",
                    "caption": "'A static string variable declared in a class.'"
                },
                {
                    "url": "/Constants & Variables/OUTPUT(Static Variable).png",
                    "caption": "'The output in the console after running the program above.'"
                }
            ],
            "textQuiz": [],
            "trueFalseQuiz": [],
            "multipleChoiceQuiz": []
        },
        {
            "subheading": "Instance variables",
            "content": "A variable declared inside a class but not inside a method. It is called an instance variable because it is only accessible by the individual classes instance and is different for each instance of a class.",
            "images": [
                {
                    "url": "/Constants & Variables/CODE(Instance Variable).png",
                    "caption": "'Two instance variables declared in the class but outside of a method.'"
                }
            ],
            "textQuiz": [],
            "trueFalseQuiz": [],
            "multipleChoiceQuiz": []
        },
        {
            "subheading": "Constants",
            "content": "A constant in Java is like a variable but it cannot be changed after runtime (read-only). To declare a variable as a constant, just add the 'final' keyword before declaring the variable like below!\n\nThe syntax to declare final static variables is in uppercase characters with words seperated with underscores.",
            "images": [
                {
                    "url": "/Constants & Variables/CODE(Final Constant).png",
                    "caption": "'A static final string declared in a class.'"
                }
            ],
            "textQuiz": [],
            "trueFalseQuiz": [],
            "multipleChoiceQuiz": []
        }
    ]
}